Revit 2027 API
FailureMessage.HasResolutions Method
 Checks if the failure has any resolutions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasResolutions()
Public Function HasResolutions As Boolean
public:
bool HasResolutions()
member HasResolutions : unit -> bool
Return Value
Boolean
 True if the failure has any resolutions, false otherwise.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace